app/views/carts/_cart.html.erb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 980190963], ["LIMIT", 1]]
---
<% unless cart.line_items.empty? %>