app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-10-24 06:28:02.067072"], ["updated_at", "2017-10-24 06:28:02.067072"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dave Thomas"], ["address", "MyText"], ["email", "dave@example.org"], ["pay_type", 1], ["created_at", "2017-10-24 06:28:02.069880"], ["updated_at", "2017-10-24 06:28:02.069880"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_to_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])